xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
static esp_err_t example_ble_mesh_set_msg_common(
    esp_ble_mesh_client_common_param_t *common, esp_ble_mesh_node_t *node,
    esp_ble_mesh_model_t *model, uint32_t opcode) {
    if (!common || !node || !model) {
        return ESP_ERR_INVALID_ARG;
    }

    common->opcode = opcode;
    common->model = model;
    common->ctx.net_idx = prov_key.net_idx;
    common->ctx.app_idx = prov_key.app_idx;
    common->ctx.addr = node->unicast_addr;
    common->ctx.send_ttl = MSG_SEND_TTL;
    common->msg_timeout = MSG_TIMEOUT;
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0)
    common->msg_role = MSG_ROLE;
#endif

    return ESP_OK;
}

static esp_err_t prov_complete(char *addr_str, int node_idx,
                               const esp_ble_mesh_octet16_t uuid,
                               uint16_t unicast, uint8_t elem_num,
                               uint16_t net_idx) {
    esp_ble_mesh_client_common_param_t common = {0};
    esp_ble_mesh_cfg_client_get_state_t get_state = {0};
    esp_ble_mesh_node_t *node = NULL;
    char name[11] = {0};
    int err;

    ESP_LOGI(TAG,
             "node index: 0x%x, unicast address: 0x%02x, element num: %d, "
             "netkey index: 0x%02x",
             node_idx, unicast, elem_num, net_idx);
    ESP_LOGI(TAG, "device uuid: %s", bt_hex(uuid, 16));

    sprintf(name, "%s%d", "NODE-", node_idx);
    err = esp_ble_mesh_provisioner_set_node_name(node_idx, name);
    if (err) {
        ESP_LOGE(TAG, "%s: Set node name failed", __func__);
        return ESP_FAIL;
    }

    // ------------------------------
    // Publisher callback to server cloud
    char mqtt_message[128];
    snprintf(mqtt_message, sizeof(mqtt_message),
             "{\"unicast_addr\":%d, \"mac_address\":\"%s\"}", unicast,
             addr_str);
    // Publish the data via MQTT
    int msg_id = esp_mqtt_client_publish(get_mqtt_client(), "home_iot/create",
                                         mqtt_message, 0, 0, 0);
    ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
    // -------------------------------

    node = esp_ble_mesh_provisioner_get_node_with_addr(unicast);
    if (!node) {
        ESP_LOGE(TAG, "%s: Get node info failed", __func__);
        return ESP_FAIL;
    }

    example_ble_mesh_set_msg_common(&common, node, config_client.model,
                                    ESP_BLE_MESH_MODEL_OP_COMPOSITION_DATA_GET);
    get_state.comp_data_get.page = COMP_DATA_PAGE_0;
    err = esp_ble_mesh_config_client_get_state(&common, &get_state);
    if (err) {
        ESP_LOGE(TAG, "%s: Send config comp data get failed", __func__);
        return ESP_FAIL;
    }

    return ESP_OK;
}

static void prov_link_open(esp_ble_mesh_prov_bearer_t bearer) {
    ESP_LOGI(TAG, "%s link open",
             bearer == ESP_BLE_MESH_PROV_ADV ? "PB-ADV" : "PB-GATT");
}

static void prov_link_close(esp_ble_mesh_prov_bearer_t bearer, uint8_t reason) {
    ESP_LOGI(TAG, "%s link close, reason 0x%02x",
             bearer == ESP_BLE_MESH_PROV_ADV ? "PB-ADV" : "PB-GATT", reason);
}

static bool device_found(const char *addr) {
    for (int i = 0; i < num_devices; i++) {
        if (strcmp(found_devices[i], addr) == 0) {
            return true;
        }
    }
    return false;
}

static void add_device(const char *addr) {
    if (num_devices < MAX_DEVICES) {
        strncpy(found_devices[num_devices], addr, 18);
        num_devices++;
    }
}

static void reset_devices() {
    for (int i = 0; i < num_devices; i++) {
        memset(found_devices[i], 0, sizeof(found_devices[i]));
    }
    num_devices = 0;
}

static void recv_unprov_adv_pkt(uint8_t dev_uuid[16], uint8_t addr[BD_ADDR_LEN],
                                esp_ble_mesh_addr_type_t addr_type,
                                uint16_t oob_info, uint8_t adv_type,
                                esp_ble_mesh_prov_bearer_t bearer) {
    /* Due to the API esp_ble_mesh_provisioner_set_dev_uuid_match, Provisioner
     * will only use this callback to report the devices, whose device UUID
     * starts with 0xdd & 0xdd, to the application layer.
     */
    // Check device stored
    char addr_str[18];
    snprintf(addr_str, sizeof(addr_str), "%02X:%02X:%02X:%02X:%02X:%02X",
             addr[0], addr[1], addr[2], addr[3], addr[4], addr[5]);
    if (!device_found(addr_str)) {
        add_device(addr_str);

        // Printf Device Unprovision
        ESP_LOGI(TAG, "ESP_BLE_MESH_PROVISIONER_RECV_UNPROV_ADV_PKT_EVT");
        ESP_LOGI(TAG, "address: %s, address type: %d, adv type: %d",
                 bt_hex(addr, BD_ADDR_LEN), addr_type, adv_type);
        ESP_LOGI(TAG, "device uuid: %s", bt_hex(dev_uuid, 16));
        ESP_LOGI(TAG, "oob info: %d, bearer: %s", oob_info,
                 (bearer & ESP_BLE_MESH_PROV_ADV) ? "PB-ADV" : "PB-GATT");

        // ------------------------------

        // Get the MAC address of the provisioner
        uint8_t mac[6];
        esp_wifi_get_mac(ESP_IF_WIFI_STA, mac);
        // Convert the MAC address to a string
        char mac_str[32];
        snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                 mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

        // Publisher callback to server cloud
        char mqtt_message[256];
        snprintf(mqtt_message, sizeof(mqtt_message),
                 "{\"addr\":\"%s\", \"addr_type\":%d, \"dev_uuid\":\"%s\", "
                 "\"oob_info\":%d, \"bearer\":%d, \"gateway\":\"%s\"}",
                 addr_str, addr_type, bt_hex(dev_uuid, 16), oob_info, bearer,
                 mac_str);

        // Publish the data via MQTT
        int msg_id = esp_mqtt_client_publish(
            get_mqtt_client(), "home_iot/gatewayScan", mqtt_message, 0, 0, 0);
        ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
        // -------------------------------
    }
    return;
}

static void mqtt_action_provision(uint8_t dev_uuid[16],
                                  uint8_t addr[BD_ADDR_LEN],
                                  esp_ble_mesh_addr_type_t addr_type,
                                  uint16_t oob_info,
                                  esp_ble_mesh_prov_bearer_t bearer) {
    esp_ble_mesh_unprov_dev_add_t add_dev = {0};
    int err;

    memcpy(add_dev.addr, addr, BD_ADDR_LEN);
    add_dev.addr_type = (esp_ble_mesh_addr_type_t)addr_type;
    memcpy(add_dev.uuid, dev_uuid, 16);
    add_dev.oob_info = oob_info;
    add_dev.bearer = (esp_ble_mesh_prov_bearer_t)bearer;
    /* Note: If unprovisioned device adv packets have not been received, we
       should not add device with ADD_DEV_START_PROV_NOW_FLAG set. */
    err = esp_ble_mesh_provisioner_add_unprov_dev(
        &add_dev, (esp_ble_mesh_dev_add_flag_t)(ADD_DEV_RM_AFTER_PROV_FLAG |
                                                ADD_DEV_START_PROV_NOW_FLAG |
                                                ADD_DEV_FLUSHABLE_DEV_FLAG));
    if (err) {
        ESP_LOGE(TAG, "%s: Add unprovisioned device into queue failed",
                 __func__);
    }
    return;
}

void example_ble_mesh_send_sensor_message(uint16_t addr, uint32_t opcode) {
    esp_ble_mesh_sensor_client_get_state_t get = {0};
    esp_ble_mesh_client_common_param_t common = {0};
    esp_ble_mesh_node_t *node = NULL;
    esp_err_t err = ESP_OK;

    node = esp_ble_mesh_provisioner_get_node_with_addr(addr);
    if (node == NULL) {
        ESP_LOGE(TAG, "Node 0x%04x not exists", addr);
        return;
    }

    example_ble_mesh_set_msg_common(&common, node, sensor_client.model, opcode);
    switch (opcode) {
        case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_GET:
            get.cadence_get.property_id = sensor_prop_id;
            break;
        case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTINGS_GET:
            get.settings_get.sensor_property_id = sensor_prop_id;
            break;
        case ESP_BLE_MESH_MODEL_OP_SENSOR_SERIES_GET:
            get.series_get.property_id = sensor_prop_id;
            break;
        default:
            break;
    }

