xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
    switch (event) {
        case ESP_BLE_MESH_SENSOR_CLIENT_GET_STATE_EVT:
            switch (param->params->opcode) {
                case ESP_BLE_MESH_MODEL_OP_SENSOR_DESCRIPTOR_GET:
                    ESP_LOGI(TAG,
                             "Sensor Descriptor Status, opcode 0x%04" PRIx32,
                             param->params->ctx.recv_op);
                    if (param->status_cb.descriptor_status.descriptor->len !=
                            ESP_BLE_MESH_SENSOR_SETTING_PROPERTY_ID_LEN &&
                        param->status_cb.descriptor_status.descriptor->len %
                            ESP_BLE_MESH_SENSOR_DESCRIPTOR_LEN) {
                        ESP_LOGE(
                            TAG, "Invalid Sensor Descriptor Status length %d",
                            param->status_cb.descriptor_status.descriptor->len);
                        return;
                    }
                    if (param->status_cb.descriptor_status.descriptor->len) {
                        ESP_LOG_BUFFER_HEX(
                            "Sensor Descriptor",
                            param->status_cb.descriptor_status.descriptor->data,
                            param->status_cb.descriptor_status.descriptor->len);
                        /* If running with sensor server example, sensor
                        client can get two Sensor Property IDs.
                         * Currently we use the first Sensor Property ID for
                         the following demonstration.
                         */
                        sensor_prop_id = param->status_cb.descriptor_status
                                                 .descriptor->data[1]
                                             << 8 |
                                         param->status_cb.descriptor_status
                                             .descriptor->data[0];
                    }
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_GET:
                    ESP_LOGI(TAG,
                             "Sensor Cadence Status, opcode 0x%04" PRIx32
                             ", Sensor Property ID 0x%04x",
                             param->params->ctx.recv_op,
                             param->status_cb.cadence_status.property_id);
                    ESP_LOG_BUFFER_HEX("Sensor Cadence",
                                       param->status_cb.cadence_status
                                           .sensor_cadence_value->data,
                                       param->status_cb.cadence_status
                                           .sensor_cadence_value->len);
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTINGS_GET:
                    ESP_LOGI(
                        TAG,
                        "Sensor Settings Status, opcode 0x%04" PRIx32
                        ", Sensor Property ID 0x%04x",
                        param->params->ctx.recv_op,
                        param->status_cb.settings_status.sensor_property_id);
                    ESP_LOG_BUFFER_HEX("Sensor Settings",
                                       param->status_cb.settings_status
                                           .sensor_setting_property_ids->data,
                                       param->status_cb.settings_status
                                           .sensor_setting_property_ids->len);
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTING_GET:
                    ESP_LOGI(TAG,
                             "Sensor Setting Status, opcode 0x%04" PRIx32
                             ", Sensor Property ID 0x%04x, Sensor Setting "
                             "Property ID 0x%04x",
                             param->params->ctx.recv_op,
                             param->status_cb.setting_status.sensor_property_id,
                             param->status_cb.setting_status
                                 .sensor_setting_property_id);
                    if (param->status_cb.setting_status.op_en) {
                        ESP_LOGI(TAG, "Sensor Setting Access 0x%02x",
                                 param->status_cb.setting_status
                                     .sensor_setting_access);
                        ESP_LOG_BUFFER_HEX("Sensor Setting Raw",
                                           param->status_cb.setting_status
                                               .sensor_setting_raw->data,
                                           param->status_cb.setting_status
                                               .sensor_setting_raw->len);
                    }
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_GET:
                    ESP_LOGI(TAG, "Sensor Status, opcode 0x%04" PRIx32,
                             param->params->ctx.recv_op);
                    if (param->status_cb.sensor_status.marshalled_sensor_data
                            ->len) {
                        ESP_LOG_BUFFER_HEX("Sensor Data",
                                           param->status_cb.sensor_status
                                               .marshalled_sensor_data->data,
                                           param->status_cb.sensor_status
                                               .marshalled_sensor_data->len);
                        double savedValues[3];
                        int savedIndex = 0;
                        uint8_t *data = param->status_cb.sensor_status
                                            .marshalled_sensor_data->data;
                        uint16_t length = 0;
                        for (; length < param->status_cb.sensor_status
                                            .marshalled_sensor_data->len;) {
                            uint8_t fmt =
                                ESP_BLE_MESH_GET_SENSOR_DATA_FORMAT(data);
                            uint8_t data_len =
                                ESP_BLE_MESH_GET_SENSOR_DATA_LENGTH(data, fmt);
                            uint16_t prop_id =
                                ESP_BLE_MESH_GET_SENSOR_DATA_PROPERTY_ID(data,
                                                                         fmt);
                            uint8_t mpid_len =
                                (fmt == ESP_BLE_MESH_SENSOR_DATA_FORMAT_A
                                     ? ESP_BLE_MESH_SENSOR_DATA_FORMAT_A_MPID_LEN
                                     : ESP_BLE_MESH_SENSOR_DATA_FORMAT_B_MPID_LEN);
                            ESP_LOGI(TAG,
                                     "Format %s, length 0x%02x, Sensor "
                                     "Property ID 0x%04x",
                                     fmt == ESP_BLE_MESH_SENSOR_DATA_FORMAT_A
                                         ? "A"
                                         : "B",
                                     data_len, prop_id);
                            if (data_len != ESP_BLE_MESH_SENSOR_DATA_ZERO_LEN) {
                                uint8_t new_data[data_len + 1];
                                memcpy(new_data, data + mpid_len, data_len + 1);
                                char hex_str[data_len * 2 + 1];
                                for (int i = data_len; i >= 0; --i) {
                                    sprintf(&hex_str[(data_len - i) * 2],
                                            "%02X", new_data[i]);
                                }
                                unsigned long decimal_value =
                                    strtoul(hex_str, NULL, 16);
                                double final_value = decimal_value / 100.0;
                                ESP_LOGI(TAG, "Data: %f", final_value);
                                savedValues[savedIndex++] = final_value;
                                length += mpid_len + data_len + 1;
                                data += mpid_len + data_len + 1;
                            } else {
                                length += mpid_len;
                                data += mpid_len;
                            }
                        }
                        send_to_cloud(savedValues, savedIndex,
                                      param->params->ctx.addr);
                        memset(savedValues, 0, sizeof(savedValues));
                        savedIndex = 0;
                    }
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_COLUMN_GET:
                    ESP_LOGI(TAG,
                             "Sensor Column Status, opcode 0x%04" PRIx32
                             ", Sensor Property ID 0x%04x",
                             param->params->ctx.recv_op,
                             param->status_cb.column_status.property_id);
                    ESP_LOG_BUFFER_HEX("Sensor Column",
                                       param->status_cb.column_status
                                           .sensor_column_value->data,
                                       param->status_cb.column_status
                                           .sensor_column_value->len);
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_SERIES_GET:
                    ESP_LOGI(TAG,
                             "Sensor Series Status, opcode 0x%04" PRIx32
                             ", Sensor Property ID 0x%04x",
                             param->params->ctx.recv_op,
                             param->status_cb.series_status.property_id);
                    ESP_LOG_BUFFER_HEX("Sensor Series",
                                       param->status_cb.series_status
                                           .sensor_series_value->data,
                                       param->status_cb.series_status
                                           .sensor_series_value->len);
                    break;
                default:
                    ESP_LOGE(TAG, "Unknown Sensor Get opcode 0x%04" PRIx32,
                             param->params->ctx.recv_op);
                    break;
            }
            break;
        case ESP_BLE_MESH_SENSOR_CLIENT_SET_STATE_EVT:
            switch (param->params->opcode) {
                case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_SET:
                    ESP_LOGI(TAG,
                             "Sensor Cadence Status, opcode 0x%04" PRIx32
                             ", Sensor Property ID 0x%04x",
                             param->params->ctx.recv_op,
                             param->status_cb.cadence_status.property_id);
                    ESP_LOG_BUFFER_HEX("Sensor Cadence",
                                       param->status_cb.cadence_status
                                           .sensor_cadence_value->data,
                                       param->status_cb.cadence_status
                                           .sensor_cadence_value->len);
                    break;
                case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTING_SET:
                    ESP_LOGI(TAG,
                             "Sensor Setting Status, opcode 0x%04" PRIx32
                             ", Sensor Property ID 0x%04x, Sensor Setting "
                             "Property ID 0x%04x",
                             param->params->ctx.recv_op,
                             param->status_cb.setting_status.sensor_property_id,
                             param->status_cb.setting_status
                                 .sensor_setting_property_id);
                    if (param->status_cb.setting_status.op_en) {
                        ESP_LOGI(TAG, "Sensor Setting Access 0x%02x",
                                 param->status_cb.setting_status
                                     .sensor_setting_access);
                        ESP_LOG_BUFFER_HEX("Sensor Setting Raw",
                                           param->status_cb.setting_status
                                               .sensor_setting_raw->data,
                                           param->status_cb.setting_status
                                               .sensor_setting_raw->len);
                    }
                    break;
                default:
                    ESP_LOGE(TAG, "Unknown Sensor Set opcode 0x%04" PRIx32,
                             param->params->ctx.recv_op);
                    break;
            }
            break;
        case ESP_BLE_MESH_SENSOR_CLIENT_PUBLISH_EVT:
            switch (param->params->opcode) {
                case ESP_BLE_MESH_MODEL_OP_SENSOR_STATUS:
                    ESP_LOGI(TAG, "Sensor Status, opcode 0x%04" PRIx32,
                             param->params->ctx.recv_op);
                    if (param->status_cb.sensor_status.marshalled_sensor_data
                            ->len) {
                        ESP_LOG_BUFFER_HEX("Sensor Data",
                                           param->status_cb.sensor_status
                                               .marshalled_sensor_data->data,
                                           param->status_cb.sensor_status
                                               .marshalled_sensor_data->len);
                        double savedValues[3];
                        int savedIndex = 0;
                        uint8_t *data = param->status_cb.sensor_status
                                            .marshalled_sensor_data->data;
                        uint16_t length = 0;
                        for (; length < param->status_cb.sensor_status
                                            .marshalled_sensor_data->len;) {
                            uint8_t fmt =
                                ESP_BLE_MESH_GET_SENSOR_DATA_FORMAT(data);
                            uint8_t data_len =
                                ESP_BLE_MESH_GET_SENSOR_DATA_LENGTH(data, fmt);
                            uint16_t prop_id =
                                ESP_BLE_MESH_GET_SENSOR_DATA_PROPERTY_ID(data,
                                                                         fmt);
                            uint8_t mpid_len =
                                (fmt == ESP_BLE_MESH_SENSOR_DATA_FORMAT_A
                                     ? ESP_BLE_MESH_SENSOR_DATA_FORMAT_A_MPID_LEN
                                     : ESP_BLE_MESH_SENSOR_DATA_FORMAT_B_MPID_LEN);
                            ESP_LOGI(TAG,
                                     "Format %s, length 0x%02x, Sensor "
                                     "Property ID 0x%04x",
                                     fmt == ESP_BLE_MESH_SENSOR_DATA_FORMAT_A
                                         ? "A"
                                         : "B",
                                     data_len, prop_id);
                            if (data_len != ESP_BLE_MESH_SENSOR_DATA_ZERO_LEN) {
                                uint8_t new_data[data_len + 1];
                                memcpy(new_data, data + mpid_len, data_len + 1);
                                char hex_str[data_len * 2 + 1];
                                for (int i = data_len; i >= 0; --i) {
                                    sprintf(&hex_str[(data_len - i) * 2],
                                            "%02X", new_data[i]);
                                }
                                unsigned long decimal_value =
                                    strtoul(hex_str, NULL, 16);
                                double final_value = decimal_value / 100.0;
                                ESP_LOGI(TAG, "Data: %f", final_value);
                                savedValues[savedIndex++] = final_value;
                                length += mpid_len + data_len + 1;
                                data += mpid_len + data_len + 1;
                            } else {
                                length += mpid_len;
                                data += mpid_len;
                            }
                        }
                        send_to_cloud(savedValues, savedIndex,
                                      param->params->ctx.addr);
                        memset(savedValues, 0, sizeof(savedValues));
                        savedIndex = 0;
                    }
                    break;
            }
            break;
        case ESP_BLE_MESH_SENSOR_CLIENT_TIMEOUT_EVT:
            // example_ble_mesh_sensor_timeout(param->params->opcode);
        default:
            break;
    }
}

