xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
            printf("Send -> ");
            ESP_LOGI(TAG, "address: %s, address type: %d",
                     bt_hex(addr, BD_ADDR_LEN), addr_type);
            ESP_LOGI(TAG, "device uuid: %s", bt_hex(dev_uuid, 16));
            ESP_LOGI(TAG, "oob info: %d, bearer: %s", oob_info,
                     (bearer & ESP_BLE_MESH_PROV_ADV) ? "PB-ADV" : "PB-GATT");
            mqtt_action_provision(dev_uuid, addr, addr_type, oob_info, bearer);
            break;
        case MQTT_ACTION_CONTROL:
            uint16_t addr_control = 0x0000;
            uint16_t state = 9999;
            // Get addr
            cJSON *addr_item_control = cJSON_GetObjectItem(root, "addr");
            if (addr_item_control != NULL &&
                cJSON_IsString(addr_item_control)) {
                addr_control =
                    (uint16_t)strtol(addr_item_control->valuestring, NULL, 16);
            }
            // Get state
            cJSON *state_item = cJSON_GetObjectItem(root, "state");
            if (state_item != NULL && cJSON_IsNumber(state_item)) {
                state = (uint16_t)state_item->valueint;
            }
            printf("Send -> 0x%04x, 0x%04x\n", addr_control, state);
            send_control_led_switch_state(addr_control, state);
            break;
        case MQTT_ACTION_GET_SENSOR_DATA:
            // {"action":6,"addr":"0x0006","state":0}
            uint16_t addr_action_6 = 0x0000;
            uint16_t state_6 = 9999;

            // Get addr
            cJSON *addr_item_control_6 = cJSON_GetObjectItem(root, "addr");
            if (addr_item_control_6 != NULL &&
                cJSON_IsString(addr_item_control_6)) {
                addr_action_6 = (uint16_t)strtol(
                    addr_item_control_6->valuestring, NULL, 16);
            }
            // Get state
            cJSON *state_item_6 = cJSON_GetObjectItem(root, "state");
            if (state_item_6 != NULL && cJSON_IsNumber(state_item_6)) {
                state_6 = (uint16_t)state_item_6->valueint;
            }
            uint32_t send_opcode[] = {
                [0] = ESP_BLE_MESH_MODEL_OP_SENSOR_DESCRIPTOR_GET,
                [1] = ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_GET,
                [2] = ESP_BLE_MESH_MODEL_OP_SENSOR_SETTINGS_GET,
                [3] = ESP_BLE_MESH_MODEL_OP_SENSOR_GET,
                [4] = ESP_BLE_MESH_MODEL_OP_SENSOR_SERIES_GET,
            };

            printf("Send -> 0x%04x, 0x%04x\n", addr_action_6, state_6);
            example_ble_mesh_send_sensor_message(addr_action_6,
                                                 send_opcode[state_6]);
            break;
        case MQTT_ACTION_REMOVE_NODE:
            // {"action":7,"addr":"0x0006"}
            uint16_t addr_action_7 = 0x0000;
            cJSON *addr_item_action_7 = cJSON_GetObjectItem(root, "addr");
            if (addr_item_action_7 != NULL &&
                cJSON_IsString(addr_item_action_7)) {
                addr_action_7 =
                    (uint16_t)strtol(addr_item_action_7->valuestring, NULL, 16);
            }
            cJSON *type_item_action_7 = cJSON_GetObjectItem(root, "type");
            if (type_item_action_7 != NULL &&
                cJSON_IsString(type_item_action_7)) {
                model_setup =
                    malloc(strlen(type_item_action_7->valuestring) + 1);
                if (model_setup != NULL) {
                    strcpy(model_setup, type_item_action_7->valuestring);
                } else {
                    printf("Memory allocation failed\n");
                }
            }
            printf("Send -> 0x%04x\n", addr_action_7);
            send_reset_node(addr_action_7);
            break;
        case MQTT_ACTION_HEARTBEAT:
            // {"action":8}
            const esp_ble_mesh_node_t **node_entry =
                esp_ble_mesh_provisioner_get_node_table_entry();
            for (int i = 0; i < CONFIG_BLE_MESH_MAX_PROV_NODES; i++) {
                const esp_ble_mesh_node_t *node = node_entry[i];
                if (node) {
                    printf("Node Addr: 0x%04x\n", node->unicast_addr);
                    send_heartbeat_node(node);
                }
            }
            break;
        case MQTT_ACTION_GATEWAY_STATE:
            // {"action":9}
            char mac_str[18];
            sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X", mac_address[0],
                    mac_address[1], mac_address[2], mac_address[3],
                    mac_address[4], mac_address[5]);
            send_node_state_to_cloud(mac_str, 0x0001);
            break;
        default:
            break;
    }
}

void send_heartbeat_to_all_nodes_task(void *param) {
    while (1) {
        const esp_ble_mesh_node_t **node_entry =
            esp_ble_mesh_provisioner_get_node_table_entry();
        for (int i = 0; i < CONFIG_BLE_MESH_MAX_PROV_NODES; i++) {
            const esp_ble_mesh_node_t *node = node_entry[i];
            if (node) {
                send_heartbeat_node(node);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(30000));  // Delay for 30 seconds
    }
}

void app_main(void) {
    esp_err_t err;

    ESP_LOGI(TAG, "Initializing...");
    esp_read_mac(mac_address, 0);

    err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    err = bluetooth_init();
    if (err) {
        ESP_LOGE(TAG, "esp32_bluetooth_init failed (err %d)", err);
        return;
    }

    ble_mesh_get_dev_uuid(dev_uuid);

    /* Initialize the Bluetooth Mesh Subsystem */
    err = ble_mesh_init();
    if (err) {
        ESP_LOGE(TAG, "Bluetooth mesh init failed (err %d)", err);
    }
    mqtt_data_pt_set_callback(mqtt_data_callback);
    wifi_init_sta();
    xTaskCreate(send_heartbeat_to_all_nodes_task, "SendHeartbeatTask", 2048,
                NULL, 5, NULL);
}